[
  {
    "role": "Reader",
    "organisation": "University of California, Davis",
    "startDate": "January, 2026",
    "endDate": "Present",
    "experiences": [
      "Graded assignments and in-class activities for the course DES198: AI and Design, providing constructive feedback to enhance student learning.",
      "Supported students in understanding design and AI trade-offs, usability challenges, and ethical considerations.",
      "Participated in lectures to ensure alignment with course goals and consistency in assessments."
    ],
    "imageSrc": "history/ucd.png"
  },
  {
    "role": "Associate Member of Technical staff",
    "organisation": "Athenahealth",
    "startDate": "January, 2025",
    "endDate": "Present",
    "experiences": [
      "Enhanced system security and reduced attack surfaces by implementing a password cleanup in Oracle databases.",
      "Automated user provisioning by developing workflows that integrated external hospital IdPs, reducing manual onboarding time for thousands of healthcare professionals by over 80%.",
      "Engineered a backend user migration service to transition accounts from Athenahealth’s application to Okta, enabling secure and centralized identity management."
    ],
    "imageSrc": "history/athenahealth.png"
  },
  {
    "role": "Associate Devops Engineer",
    "organisation": "Sprinklr",
    "startDate": "August, 2024",
    "endDate": "December, 2024",
    "experiences": [
      "Automated Elasticsearch infrastructure setup using Ansible, improving deployment speed by over 90%.",
      "Designed and implemented self-healing scripts for monitoring Elasticsearch server health.",
      "Reduced the Recovery Time Objective (RTO) by over 90% by automating the entire disaster recovery process with Ansible playbooks, which minimized manual intervention."
    ],
    "imageSrc": "history/sprinklr.png"
  },
  {
    "role": "Devops Intern",
    "organisation": "Sprinklr",
    "startDate": "January, 2024",
    "endDate": "June, 2024",
    "experiences": [
      " Reduced the Recovery Point Objective (RPO) to under 2 hours by designing and implementing disaster recovery solutions using Python scripts, Elasticsearch, MongoDB, and AWS for near real-time data replication.",
      "Modernized the codebase by refactoring legacy Perl scripts into Python to improve performance and long-term maintainability."
    ],
    "imageSrc": "history/sprinklr.png"
  },
  {
    "role": "Teaching Assistant for DBMS course",
    "organisation": "PES University",
    "startDate": "Aug, 2023",
    "endDate": "Dec, 2023",
    "experiences": [
      "Designed and authored comprehensive course materials for a cohort of 700 students, enhancing their understanding of database systems.",
      "Developed over a dozen practical assignments that reinforced core concepts and promoted problem-solving skills.",
      "Assisted with grading, office hours, and student guidance, fostering a supportive learning environment."
    ],
    "imageSrc": "history/pesu.png"
  }
  
]
