[
  {
    "role": "Associate Member of Technical staff",
    "organisation": "Athenahealth",
    "startDate": "January, 2025",
    "endDate": "Present",
    "experiences": [
      "Implemented a password cleanup strategy in Oracle databases, strengthening overall system security and reducing attack surfaces.",
      "Developed and supported automated user provisioning workflows from external hospital Identity Providers (IdPs) reducing on-boarding time by over 90%.",
      "Developed the backend for a user migration service to transition user accounts from Athenahealth’s application to Okta, enabling secure and centralized identity management."
    ],
    "imageSrc": "history/athenahealth.png"
  },
  {
    "role": "Associate Devops Engineer",
    "organisation": "Sprinklr",
    "startDate": "August, 2024",
    "endDate": "December, 2025",
    "experiences": [
      "Completely automated the process of setup of infrastructure for Elasticsearch servers using Ansible and improved the speed of setup by over 90%.",
      "Involved in designing and creating resiliency scripts for monitoring resources deployed on Elasticsearch servers, as well as implementing auto-remediation tasks in response to any server-related issues.",
      "Involved in reducing the recovery time objective(RTO) by over 90% by making solutions for automating the entire process of disaster recovery by using Ansible playbooks and minimizing manual intervention."
    ],
    "imageSrc": "history/sprinklr.png"
  },
  {
    "role": "Devops Intern",
    "organisation": "Sprinklr",
    "startDate": "January, 2024",
    "endDate": "June, 2024",
    "experiences": [
      "Designed disaster recovery solutions by making solutions for almost real-time replication of data in the disaster recovery environment.",
      "This resulted in a decrease of the recovery point objective (RPO) to almost 2 hours and improved fault tolerance by more than 99%.",
      "Refactored legacy code written in perl to python."
    ],
    "imageSrc": "history/sprinklr.png"
  },
  {
    "role": "Teaching Assistant for DBMS course",
    "organisation": "PES University",
    "startDate": "Aug, 2023",
    "endDate": "Dec, 2023",
    "experiences": [
      "Assisted in the creation of new course material from scratch based on the concepts from the textbook Database System Concepts and variety of online resources.",
      "Developed practical and challenging course assignments on a weekly basis throughout the semester."
    ],
    "imageSrc": "history/pesu.png"
  }
  
]
